In [21]:
import pandas as pd

In [2]:
l1=[3,2,3,4]
l1.insert(2,45)
l1

[3, 2, 45, 3, 4]

In [3]:
s1 = {2,5,4,2,3}
s1

{2, 3, 4, 5}

In [4]:
s1.add(2)

In [5]:
s1

{2, 3, 4, 5}

In [32]:
s1 = list(map(int,s1))
s1=set(s1)
s1

{1, 2, 3, 4, 5, 6, 8, 9, 51, 52, 56, 57}

In [35]:
a = [1,2,3,4,5]
b = ['a','b']
a.extend(b)
print(a)

c = [1,2,3]
a.append(c)
print(a)

[1, 2, 3, 4, 5, 'a', 'b']
[1, 2, 3, 4, 5, 'a', 'b', [1, 2, 3]]

In [36]:
st1 = "hello"
st2 = "hello"
print(id(st1),id(st2))

1474522511264 1474522511264

In [52]:
a

[10, 20, 30, 40, 50]

In [53]:
d = {1:"one",1:"two"}

In [61]:
a = 'this is a sample string with many characters'
print(set(a))
b= set(a)
len(b)

{'l', 'h', 'n', 'm', 'g', 'a', 'y', ' ', 'r', 'i', 's', 'c', 'w', 'p', 't', 'e'}

16

In [71]:
#to sort a list

l1 = ['1','4','10','5','12']
l2 = sorted(l1)
print(l2)

l3 = list(map(int,l1))
l3.sort()
print(l3)

['1', '10', '12', '4', '5']
[1, 4, 5, 10, 12]

In [4]:
import pandas as pd
dc = {"RollNo":[1,2,3],"Name":["Rohan","Ram","Rakesh"],"City":["Pune","Hydrabad","Delhi"],"Class":["7th","9th","4th"]}
df = pd.DataFrame(dc)
df["Math"]=[45,78,91]
df

   RollNo    Name      City Class  Math
0       1   Rohan      Pune   7th    45
1       2     Ram  Hydrabad   9th    78
2       3  Rakesh     Delhi   4th    91

In [5]:
df["English"]=[56,54,89]
df

   RollNo    Name      City Class  Math  English
0       1   Rohan      Pune   7th    45       56
1       2     Ram  Hydrabad   9th    78       54
2       3  Rakesh     Delhi   4th    91       89

In [9]:
df["Percentage"]=(df["Math"]+df["English"])/2
df

   RollNo    Name      City Class  Math  English  Percentage
0       1   Rohan      Pune   7th    45       56        50.5
1       2     Ram  Hydrabad   9th    78       54        66.0
2       3  Rakesh     Delhi   4th    91       89        90.0

In [11]:
df.drop(columns="Percentage",inplace=True)
df

   RollNo    Name      City Class  Math  English
0       1   Rohan      Pune   7th    45       56
1       2     Ram  Hydrabad   9th    78       54
2       3  Rakesh     Delhi   4th    91       89

In [17]:
df[]=[4,"Raman","Indore","10th",88,59]
df

SyntaxError: invalid syntax (<ipython-input-17-88d873e30f3d>, line 1)

In [3]:

def fibonacci(n): #generator function
   a, b, counter = 0, 1, 0
   while True:
      if (counter > n): 
         return
      yield a
      a, b = b, a + b
      counter += 1
f = fibonacci(5) #f is iterator object

while True:
   try:
      print (next(f), end=" ")
   except StopIteration:
      break

0 1 1 2 3 5

In [7]:
def fun(a,b):
    return a/b


def smart_fun(f):
    def inner_fun(x,y):
        if x<y:
            x,y=y,x
        return f(x,y)
    return inner_fun

fun = smart_fun(fun)        

fun(2,4)

2.0

In [50]:
fib = lambda n,a=0,b=1: a if n<=0 else fib(n-1,b,a+b)
fib(4)

3

In [57]:
list1=[1,2,3,4,5]

print(list1[0])
for i in list1:
    print(i)

1
1
2
3
4
5

In [6]:
class Topten():
    def __init__(self):
        self.num=1
    def __iter__(self):
        return self
    def __next__(self):
        if self.num<=10:
            value = self.num
            self.num+=1
            return value
        else:
            raise StopIteration
            
d = Topten()

print(type(d))

<class '__main__.Topten'>

In [2]:
#prime number
x= int(input("Enter the value: "))
for i in range(2,x+1):
    if x>1:
        for j in range(2,i):
            if i%j==0:
                break
        else:
            print(i)

Enter the value: 19
2
3
5
7
11
13
17
19

In [13]:
#fibonacci series
x = int(input("Enter the range of fibonacci series: "))
j,k=0,1
for i in range(2,x+1):
    l=j+k
    print(k)
    j,k=k,l

Enter the range of fibonacci series: 9
1
1
2
3
5
8
13
21